docs/blog/compare-lisps.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-17 Thu 22:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Comparison of Lisps</title>
<meta name="author" content="Philip Dumaresq" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="assets/org.css" />
<link rel="stylesheet" type="text/css" href="../assets/org.css" />
<link rel="stylesheet" type="text/css" href="../../assets/org.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">A Comparison of Lisps</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9395c1c">Common Lisp</a></li>
<li><a href="#org8a3c9b6">Scheme</a></li>
<li><a href="#org42aa4fb">Clojure</a></li>
<li><a href="#org3fb43e8">Racket</a></li>
<li><a href="#orgfb4c5ef">Emacs Lisp</a></li>
<li><a href="#org8eff698">Conclusion</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
<a href="../index.html">Home</a> | <a href="../about.html">About</a> | <a href="../contact.html">Contact</a>
</p>
</div>
<p>
Like a lot of people, I was introduced to this weird language in university, Common Lisp, that
seemed so weird and out there that I wanted to know more about it. Even before being introduced to
it I was curious about programming languages, so I decided to dive in to Common Lisp and try to
learn a little bit more about why it. Fast-forward a few years and I&rsquo;m a huge fan of Lisp. Clojure
is my go-to language, and I&rsquo;ve contributed to the Racket and Emacs Lisp ecosystems and dabbled in
Common Lisp.
</p>

<p>
Now, not everyone has the time or patience or interest in learning all these languages and wants to
just pick one up, so I&rsquo;m going to cover some of the aspects of each dialect of lisp and why you
might want to pick it, and why you might want to avoid it.
</p>

<p>
TL;DR: If you have no specific needs or want to build web applications, do yourself a favour and
learn Clojure. I have a <a href="clojure-design">whole other article</a> about why Clojure is the <i>best</i> designed programming
language I&rsquo;ve ever touched. However, that doesn&rsquo;t mean it&rsquo;s always what you need or what you should
learn.
</p>

<div id="outline-container-org9395c1c" class="outline-2">
<h2 id="org9395c1c">Common Lisp</h2>
<div class="outline-text-2" id="text-org9395c1c">
<p>
ANSI Common Lisp was standardized in 1994, and remains today as a first choice for many people for
rapidly building extensible and introspectable applications. Common Lisp is a seriously
multi-paradigm programming language that leans in whatever direction you chose to take it. It can be
procedural, object-oriented, functional, logical, whatever you really want it to be. It has many
different implementations that will all function the same for a beginner, but give flexibility to
more experienced devs who know what they need.
</p>
</div>

<div id="outline-container-org8b5b48d" class="outline-4">
<h4 id="org8b5b48d">Would chose if&#x2026;</h4>
<div class="outline-text-4" id="text-org8b5b48d">
<ul class="org-ul">
<li>You need high-end performance</li>
<li>Live debugging in-production applications is a must</li>
</ul>
</div>
</div>

<div id="outline-container-org578bfed" class="outline-4">
<h4 id="org578bfed">Would avoid if&#x2026;</h4>
<div class="outline-text-4" id="text-org578bfed">
<ul class="org-ul">
<li>You want a small binary</li>
<li>You want something more opioninated or modern</li>
</ul>
</div>
</div>

<div id="outline-container-orgc708b78" class="outline-4">
<h4 id="orgc708b78">Cons</h4>
<div class="outline-text-4" id="text-orgc708b78">
<ul class="org-ul">
<li>Not a whole lot of packages</li>
<li>Lack of opion in the language leads to tons of ways to do things</li>
<li>Standard library can be inconsistent at times</li>
<li>Community is small, scattered, and can be unwelcoming sometimes</li>
</ul>
</div>
</div>

<div id="outline-container-orgc81a0a3" class="outline-4">
<h4 id="orgc81a0a3">Pros</h4>
<div class="outline-text-4" id="text-orgc81a0a3">
<ul class="org-ul">
<li>Very fast. Some benchmarks for the SBCL compiler show it as one of the fasted dynamic programming
languages out there</li>
<li>It&rsquo;s macro system is extremely flexible and easily allows you to do anything you want - even if it
includes shooting yourself in the foot sometimes</li>
<li>Lots of different implementations to chose from if you have specific needs</li>
<li>Interactive development leads to quick development times</li>
<li>Patching applications in production requires no down-time</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8a3c9b6" class="outline-2">
<h2 id="org8a3c9b6">Scheme</h2>
<div class="outline-text-2" id="text-org8a3c9b6">
<p>
Scheme is even older than Common Lisp, and has many more standardized versions - including ones much
more recent than Common Lisp. Scheme is typically more procedural or functional, but it can be
object-oriented or anything else as well. It&rsquo;s a very minimalistic language though, with a small
standard library that differs across standardizations and even implementations. Scheme is often used
in academics for programming language experimentation because it&rsquo;s such a simple language - simple
enough that implementing your own interpreted can be done in a weekend if you know what you&rsquo;re
doing. I like to think of Scheme as the C of lisps. It&rsquo;s minimalistic with a very small set of core
primitives, but it&rsquo;s been around for forever and is more pervasive than you&rsquo;d think. In fact, if you&rsquo;re
running a unix machine, you probably already have GNU Guile installed on it somewhere.
</p>
</div>

<div id="outline-container-org03adeb1" class="outline-4">
<h4 id="org03adeb1">Would chose if&#x2026;</h4>
<div class="outline-text-4" id="text-org03adeb1">
<ul class="org-ul">
<li>You need something with a small footprint and C interop</li>
<li>You want something that will run closer to the metal</li>
</ul>
</div>
</div>

<div id="outline-container-org71ffcb2" class="outline-4">
<h4 id="org71ffcb2">Would avoid if&#x2026;</h4>
<div class="outline-text-4" id="text-org71ffcb2">
<ul class="org-ul">
<li>You want to build an application quickly</li>
<li>You want something easy to distribute cross-platform</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd63e85" class="outline-4">
<h4 id="orgfd63e85">Cons</h4>
<div class="outline-text-4" id="text-orgfd63e85">
<ul class="org-ul">
<li>Not a whole lot of packages</li>
<li>Very small standard library means more depending on packages or building things yourself</li>
<li>Lots of implementations can be confusing to beginners</li>
<li>No standard build system</li>
<li>Figuring out exactly what your implementation supports can be confusing</li>
<li>Writing code that works across scheme implementations can be very difficult or impossible, even if
they&rsquo;re following the same standard</li>
<li>Community is small, and scattered, but is generally friendly</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2563fa" class="outline-4">
<h4 id="orgf2563fa">Pros</h4>
<div class="outline-text-4" id="text-orgf2563fa">
<ul class="org-ul">
<li>Very easy to pick up since it&rsquo;s so minimal</li>
<li>Tons of implementations that will let you build anything to run on any hardware</li>
<li>Often very good FFI to call into C functions</li>
<li>It&rsquo;s macro system is incredibly powerful, debatably more so than Common Lisp, but will also stop
you from shooting yourself in the foot</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org42aa4fb" class="outline-2">
<h2 id="org42aa4fb">Clojure</h2>
<div class="outline-text-2" id="text-org42aa4fb">
<p>
Clojure is the new kid on the block in terms of lisps. It&rsquo;s first release was in 2009 and it is in
continued active development. Clojure is very functional compared to other lisps, and just in
general unless you&rsquo;re a Haskell or ML person. Clojure is a little unique among lisps in that it&rsquo;s
designed from the ground up to be a hosted language, meaning it takes advantage of other language&rsquo;s
ecosystems. Clojure has 3 official implementations that can compile for the JVM, JavaScript or the
.NET CLR. Clojure also has a handful of unofficial implementations to offer other benefits where
something specific is needed.
</p>
</div>

<div id="outline-container-orgaf32e0c" class="outline-4">
<h4 id="orgaf32e0c">Would chose if&#x2026;</h4>
<div class="outline-text-4" id="text-orgaf32e0c">
<ul class="org-ul">
<li>You&rsquo;re building web applications (front-end or backend), CLI tools, data analysis, etc</li>
<li>You value functional programming over other paradigms</li>
<li>You want a reliable general-purpose language</li>
</ul>
</div>
</div>

<div id="outline-container-org2d82dd0" class="outline-4">
<h4 id="org2d82dd0">Would avoid if&#x2026;</h4>
<div class="outline-text-4" id="text-org2d82dd0">
<ul class="org-ul">
<li>You want to run close to the metal</li>
</ul>
</div>
</div>

<div id="outline-container-orgc3f23f0" class="outline-4">
<h4 id="orgc3f23f0">Cons</h4>
<div class="outline-text-4" id="text-orgc3f23f0">
<ul class="org-ul">
<li>Slow startup time</li>
<li>If you have an aversion to the JVM (Java knowledge is <i>not</i> required for Clojure)</li>
</ul>
</div>
</div>

<div id="outline-container-orgbde1b18" class="outline-4">
<h4 id="orgbde1b18">Pros</h4>
<div class="outline-text-4" id="text-orgbde1b18">
<ul class="org-ul">
<li>Seamless interop with host language</li>
<li>Access to host ecosystems grants Clojure millions of packages</li>
<li>Immutable by default</li>
<li>Mutation only permitted in thread-safe wrapper objects</li>
<li>Compiles to JavaScript to run in a browser</li>
<li>Large, very friendly, and helpful community</li>
<li>Can use GraalVM to compile jar files to native binaries that don&rsquo;t require a JVM</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3fb43e8" class="outline-2">
<h2 id="org3fb43e8">Racket</h2>
<div class="outline-text-2" id="text-org3fb43e8">
<p>
Racket is the natural evolution to Scheme. It first appeared in 1995, and it&rsquo;s core implementation
is still in active development. I like to think if Scheme is C, then Racket is C++. At their core,
most Scheme code is valid Racket code, but the inverse is definitely not true. Racket has a huge
standard library and many packages easily accessible through a package manager and build tool that
ships with Racket. Racket, like Scheme, leans more procedural and functional, but supports
object-oriented and any other paradigm under the sun. Racket calls itself a language-oriented
programming language since it&rsquo;s got tools built in for very easily implementing new programming
languages that run on Racket&rsquo;s runtime.
</p>
</div>

<div id="outline-container-orgac00bb5" class="outline-4">
<h4 id="orgac00bb5">Would chose if&#x2026;</h4>
<div class="outline-text-4" id="text-orgac00bb5">
<ul class="org-ul">
<li>You want to experiment with language design or build CLI tools</li>
<li>You want to embed it into another application</li>
</ul>
</div>
</div>

<div id="outline-container-orgde57d81" class="outline-4">
<h4 id="orgde57d81">Would avoid if&#x2026;</h4>
<div class="outline-text-4" id="text-orgde57d81">
<ul class="org-ul">
<li>You want to develop web applications</li>
<li>You want/need a REPL</li>
</ul>
</div>
</div>

<div id="outline-container-org6e8a929" class="outline-4">
<h4 id="org6e8a929">Cons</h4>
<div class="outline-text-4" id="text-org6e8a929">
<ul class="org-ul">
<li>Dealing with types other than linked lists can be annoying</li>
<li>Verbose function names and syntax in general</li>
<li>Immutable data structure API is weak and mutable API is frustrating verbose</li>
<li>Functions all have type prefix for their names <code>vector-ref</code>, <code>hash-ref</code>, <code>string-ref</code>, no just <code>ref</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgd4ff378" class="outline-4">
<h4 id="orgd4ff378">Pros</h4>
<div class="outline-text-4" id="text-orgd4ff378">
<ul class="org-ul">
<li>Lots of DSLs running on the same platform to give you the best language to approach a task</li>
<li>Very friendly and helpful community</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfb4c5ef" class="outline-2">
<h2 id="orgfb4c5ef">Emacs Lisp</h2>
<div class="outline-text-2" id="text-orgfb4c5ef">
<p>
Emacs Lisp is the Lisp you&rsquo;ll want if you&rsquo;re using Emacs, there&rsquo;s not much more to it. Created in
1984 by Richard Stallman, it&rsquo;s the language you&rsquo;ll be using if you&rsquo;re hacking away at the Emacs text
editor. If you get serious about any Lisp, at some point you&rsquo;re likely to try out Emacs, at which
point you&rsquo;ll eventually give ELisp a spin.
</p>
</div>

<div id="outline-container-org673cbbf" class="outline-4">
<h4 id="org673cbbf">Would chose if&#x2026;</h4>
<div class="outline-text-4" id="text-org673cbbf">
<ul class="org-ul">
<li>You need it to run in Emacs.</li>
<li>You need access to something that only runs in Emacs (ex. org-mode)</li>
</ul>
</div>
</div>

<div id="outline-container-orgb235006" class="outline-4">
<h4 id="orgb235006">Would avoid if&#x2026;</h4>
<div class="outline-text-4" id="text-orgb235006">
<ul class="org-ul">
<li>You need it to run outside Emacs</li>
</ul>
</div>
</div>

<div id="outline-container-orge5b39f0" class="outline-4">
<h4 id="orge5b39f0">Cons</h4>
<div class="outline-text-4" id="text-orge5b39f0">
<ul class="org-ul">
<li>Everything is public and global. If you don&rsquo;t want people touching an internal function or
definition, you follow a naming convention to tell people not to touch it
<ul class="org-ul">
<li>The language is wildly inconsistent and function names can be very unintuitive, and documentation
is required</li>
</ul></li>
<li>Debugging ELisp is not pleasant</li>
<li>Single threaded</li>
</ul>
</div>
</div>

<div id="outline-container-orgccea929" class="outline-4">
<h4 id="orgccea929">Pros</h4>
<div class="outline-text-4" id="text-orgccea929">
<ul class="org-ul">
<li>You can make Emacs do whatever you want. It can be a pain to work with, but it will make Emacs yours</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8eff698" class="outline-2">
<h2 id="org8eff698">Conclusion</h2>
<div class="outline-text-2" id="text-org8eff698">
<p>
Overall, as much as I told myself before starting this to be unbiased, I&rsquo;m very partial to Clojure.
The only real cons I see to it are the JVM if you have an aversion to it, and the slow startup
time - both of which are easily mitigated or eliminated with other implementations or compiling with
GraalVM. However, it&rsquo;s still not for everyone.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Philip Dumaresq</p>
<p class="date">Created: 2022-02-17 Thu 22:38</p>
</div>
</body>
</html>
